#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <locale.h>
#include <math.h>
main()
{
	setlocale(LC_CTYPE, "RUS");
	double x, y;
	puts("Для того, чтобы координаты принадлежали заданной области, точка их пересечения должна находиться на расстоянии (которое высчитывается по теореме Пифагора) от 3 до 5 от точки начала отсчета координат, а также координата x должна быть положительной (находиться в 1 и 4 четвертях системы координат)");
	puts("Введите значение координат x и y:\n");
	scanf("%lf\n%lf", &x, &y);
	if ((pow(pow(x, 2) + pow(y, 2), 0.5)) >= 3 && (pow(pow(x, 2) + pow(y, 2), 0.5)) <= 5 && x >= 0) printf("\nЗначения x = %lf и y = %lf принадлежат заданной области и находятся на расстоянии %lf от точки начала отсчет координат\n", x, y, pow(pow(x, 2) + pow(y, 2), 0.5));
	else if (((pow(pow(x, 2) + pow(y, 2), 0.5)) < 3 || (pow(pow(x, 2) + pow(y, 2), 0.5)) > 5) && x >= 0)printf("\nЗначения x = %lf и y = %lf не принадлежат заданной области и находятся на расстоянии %lf от точки начала отсчет координат\n", x, y, pow(pow(x, 2) + pow(y, 2), 0.5));
	else if (x < 0) printf("Так как значение x = %lf меньше 0, точка, заданная этой координатой не лежит в области допустимых значений (1 и 4 четвертях системы координат)", x);
	//при x = 3 и y = 1 точка, заданная этими координатами будет лежать в области допустимых значений
	//при x = 1 и y = 0.25 точка, заданная этими координатами не будет лежать в области допустимых значений из-за того, что расстояние от точки начала координат до заданной точки меньше 3
	//при x = -2.5 и y = 2 точка, заданная этими координатами не будет лежать в области допустимых значений из-за отрицательного значения x
}